<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"c4b7cdcf16ec38bc8c651c66ee9b3fb3e574a501c0e20b89b7a4d207a6845bb1","plan_job_ref":"Job tf-plan #2 at https://github.com/YanSharp/aws-ecs-rds-terraform/actions/runs/17214608692","plan_out_hash":"e88a0d6bcc6605c43760bb6613e31c44a298b596e9af3e83c66ae2dbcfa18ed1","plan_hash":"09c12383e7ae281dd67338c9be2ea1fc55e0f2d44a3b2b4646834b1b388afb47","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_role.example_role will be created
+   resource "aws_iam_role" "example_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "examplerole"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"     = "dev"
+           "Owner"   = "YanSharp-Terraform"
+           "Project" = "aws-ecs-rds-terraform"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [tf-plan #2](https://github.com/YanSharp/aws-ecs-rds-terraform/actions/runs/17214608692)